print("Лабораторна робота 6. 9 варіант. Корсун Єлизавета, КМ-23")
print("Рядки. Завдання 2. Визначити, скільки нульових елементів міститься у верхніх f рядках і в лівих d стовпцях матриці А.")
A = [[0, 9, 0, 9, 0, 9],
[0, 4, 0, 5, 7, 8],
[5, 0, 8, 3, 5, 0],
[0, 3, 4, 9, 6, 11],
[2, 0, 0, 4, 9, 8]]

print('Дана матриця:\n A = |0  9  0  9  0  9 |\n     |0  4  0  5  7  8 |\n     |5  0  8  3  5  0 |\n     |0  3  4  9  6  11|\n     |2  0  0  4  9  8 |')

def f1(A, f):
    count = 0
    for i in A[f]:
        if i == 0:
            count+=1
    return count
def d1(A, d):
    r = len(A)
    count = 0
    for i in range(r):
        if A[i][d] == 0:
            count += 1
    return count

print(' ')
print('Кількість нулів у 1 верхньому рядку: ', f1(A, 0))
print('Кількість нулів у 2 верхньому рядку: ',f1(A, 1))
print(' ')
print('Кількість нулів у 1 лівому стовпці: ',d1(A,0))
print('Кількість нулів у 2 лівому стовпці: ',d1(A,1))
print(' ')
print('Кількість нулів у двох верхніх рядках і у двох лівих ствопцях: ',f1(A, 0) + f1(A, 1) + d1(A, 0)+ d1(A, 1))